'use strict'
//---------------------------------------
/*
|| (ИЛИ)
||= (Оператор логического присваивания ИЛИ)
&& (И)
&&= (Оператор логического присваивания И)
! (НЕ)

alert - всплывающее окно в верху, с кнопкой "OK"
promt - всплывающее окно в верху с возможностью ввода 
confirm - всплывающее окно в верху, как alert только с возможонстью ответить "cansel" всегда возвращает bool тип
*/
//---------------------------------------



//---------------------------------------
// alert(`давайте сложим 2 числа`)
// let a = Number(prompt('введите 1 число:'))
// let b = Number(prompt('введите 2 число:'))

// alert(`ваш ответ ${a + b}`)
//---------------------------------------


//---------------------------------------
// let b = 1
// let result = 1
// let answer = true
// while(answer) {  
//     let a = +prompt('из какого числа вы хотите вычеслить факториал?')
//     if (a > 50){
//         alert('Число слишком большое')
//         continue
//     }else {
//         result = 1
//         b = 1
//         while(b <= a) {
//             result *= b
//             b++
//             console.log(result)
//         }
//     }
//     answer = confirm(`Ваш ответ ${result} \nХотите продолжить?`)
// }
//---------------------------------------



